import pandas as pd

data_common = {
    "地市": ["武汉", "襄阳", "鄂州", "孝感", "黄冈", "黄石", "咸宁", "荆州", "宜昌", "恩施", "十堰", "随州", "荆门", "江汉", "全省"],
    "2月当月值": [83.58, 79.25, 82.84, 77.70, 80.96, 86.36, 86.60, 88.07, 87.17, 86.36, 76.39, 86.68, 85.38, 84.97, 83.73],
    "环比": [0.16, -4.49, -1.06, -6.05, 3.93, -0.08, 6.70, 7.11, -1.55, 2.21, -13.08, 1.53, 0.53, 4.66, 0.05],
    "1-2月累计值": [81.68, 81.91, 81.55, 79.02, 84.39, 82.80, 79.45, 82.85, 83.15, 81.78, 82.55, 83.14, 82.06, 82.77, 83.70],
    "定比改善": [1.82, 1.46, -0.06, 1.70, -5.38, 3.60, 3.80, 1.66, 4.80, 3.48, 0.33, 2.78, 2.85, -0.13, 1.65],
    "行业对标": [2.39, -1.88, 0.99, -4.06, -6.32, -0.33, 1.78, -0.19, 2.48, -0.20, -0.27, 2.40, 0.88, -2.82, -0.16]
}

df1 = pd.DataFrame(data_common)
df2 = pd.DataFrame(data_common)
df2["2月当月值"] = [85.79, 73.79, 76.11, 68.09, 85.00, 86.67, 71.39, 80.91, 83.61, 78.61, 80.63, 90.83, 81.94, 77.78, 80.45]
df3 = pd.DataFrame(data_common)
df3["2月当月值"] = [82.05, 75.13, 77.43, 72.61, 81.49, 82.76, 79.86, 86.44, 86.12, 79.60, 79.05, 84.43, 84.97, 83.90, 81.19]
df4 = pd.DataFrame(data_common)
df4["2月当月值"] = [85.38, 83.56, 83.21, 68.59, 94.07, 84.91, 80.71, 86.72, 97.45, 83.80, 83.95, 97.86, 88.84, 90.48, 87.04]
df5 = pd.DataFrame(data_common)
df5["2月当月值"] = [89.91, 87.46, 82.50, 74.36, 88.89, 90.56, 80.34, 89.47, 89.72, 84.62, 90.03, 97.08, 87.13, 87.18, 87.28]

with pd.ExcelWriter(r"C:\Users\HJW-236\Desktop\project\agentProject\data\满意度数据.xlsx") as writer:
    df1.to_excel(writer, sheet_name="移网网络", index=False)
    df2.to_excel(writer, sheet_name="宽带网络", index=False)
    df3.to_excel(writer, sheet_name="业务感知", index=False)
    df4.to_excel(writer, sheet_name="营业厅", index=False)
    df5.to_excel(writer, sheet_name="智家工程师", index=False)

print("测试Excel文件已创建成功！")